Repository: bazyli-bednarz/kanon
Catalog: app/translations/messages.*.xlf
Languages: pl

# app_name
source: Music History Canon
pl: Kanon Historii Muzyki

# action.add_canon
source: Add canon
pl: Dodaj kanon

# action.add_composer
source: Add composer
pl: Dodaj kompozytora

# action.add_friend
source: Add to friends
pl: Dodaj do znajomych

# action.add_piece
source: Add piece
pl: Dodaj utwór

# action.back_to_list
source: Back to the list
pl: Powrót do listy

# action.back_to_profile
source: Back to the profile
pl: Powrót do profilu

# action.change_image
source: Change profile image
pl: Zmień zdjęcie profilowe

# action.close
source: Close
pl: Zamknij

# action.delete
source: Delete
pl: Usuń

# action.edit
source: Edit
pl: Edytuj

# action.edit_user_data
source: Edit your profile
pl: Edytuj swój profil

# action.learn_more
source: Learn more
pl: Dowiedz się więcej

# action.login
source: Login
pl: Logowanie

# action.logout
source: Logout
pl: Wyloguj się

# action.register
source: Register
pl: Rejestracja

# action.remove_friend
source: Remove from friends
pl: Usuń ze znajomych

# action.reset_password
source: Reset password
pl: Resetuj hasło

# action.return_home
source: Return to the homepage
pl: Wróć do strony głównej

# action.save
source: Save
pl: Zapisz

# action.send
source: Send
pl: Wyślij

# action.sign_in
source: Sign in
pl: Zaloguj się

# action.sign_up
source: Sign up
pl: Zarejestruj się

# action.start
source: Start learning
pl: Zacznij naukę

# action.try_again
source: try again.
pl: spróbuj ponownie.

# action.user_canons
source: User canons
pl: Kanony dodane przez użytkownika

# action.user_composers
source: User composers
pl: Kompozytorzy dodani przez użytkownika

# action.user_pieces
source: User pieces
pl: Utwory dodane przez użytkownika

# action.view
source: View
pl: Zobacz

# image.403
source: Person standing and a big mobile phone with X icon on it.
pl: Stojący człowiek i duży telefon z ikoną z symbolem X.

# image.404
source: Number 404 and drawing of the mountains.
pl: Numer 404 i rysunek gór.

# image.error
source: A small one-eyed creature breaking a connection cable between a server and a computer.
pl: Mały jednooki stwór przecinający kabel łączący serwer i komputer.

# image.happy_music
source: A small bird with headphones on listening to music.
pl: Mały ptak ze słuchawkami słuchający muzyki.

# image.playful_cat
source: A smiling cat drawing.
pl: Rysunek uśmiechającego się kota.

# image.quick_chat
source: A birdie and message bubbles.
pl: Ptaszek i dymki wiadomości.

# info.about-project
source: This web application was designed and created by Bazyli Bednarz. This service is an integral part of a bachelor's thesis (major: Electronic Information Processing), prepared under the direction of prof. dr hab. Jerzy Konior at the Faculty Of Management and Social Communication, Jagiellonian University.
pl: Autorem niniejszego serwisu jest Bazyli Bednarz. Serwis ten stanowi integralną część pracy licencjackiej (kierunek: Elektroniczne Przetwarzanie Informacji), przygotowanej pod kierunkiem prof. Jerzego Koniora na Wydziale Zarządzania i Komunikacji Społecznej Uniwersytetu Jagiellońskiego.

# info.application
source: Welcome to Music History Canon! This application is for music students and enjoyers, who want to discover greatest music pieces in history!
pl: Witaj w Kanonie Historii Muzyki! Ta aplikacja jest przeznaczona dla uczniów i studentów muzyki oraz wszystkich, którzy chcą odkrywać największe dzieła muzyczne w historii!

# info.canons
source: Here you can create and edit canon lists. Later you can listen to them and learn in the Flashcards tab.
pl: Tutaj możesz tworzyć, edytować swoje kanony i dodawać do nich utwory. Posłuchaj ich później w zakładce Fiszki.

# info.composers
source: Here you can add new composers to the database. Remember that you can't delete composers that already have some pieces.
pl: Tutaj możesz dodawać nowych kompozytorów do bazy. Pamiętaj, że nie możesz usunąć kompozytorów, którym ktoś już przypisał jakieś utwory.

# info.flashcards
source: Listen to your or your friends' canons. This feature allows you to get ready for any music history listening exam in no time!
pl: Słuchaj swoich kanonów! Dzięki fiszkom przygotujesz się do każdego egzaminu słuchowego z historii muzyki w kilka chwil!

# info.login
source: Welcome back to Music History Canon!
pl: Witaj ponownie w Kanonie Historii Muzyki!

# info.pieces
source: Here you can add new pieces to the database. Remember that you can't delete pieces if somebody added them to their canons. After you enter the link to the YouTube recording of a piece, you can validate its correctness by looking if the live preview is displaying your video! That's so cool!
pl: Tutaj możesz dodawać utwory do bazy. Pamiętaj, że nie możesz usuwać utworów, które ktoś dodał do swoich kanonów. Po wpisaniu linku do nagrania w serwisie YouTube, możesz sprawdzić jego poprawność, jeśli popatrzysz na podgląd na żywo! Jeśli coś jest nie tak, spróbuj użyć innego linku.

# info.periods
source: Here you can browse musical periods. When you add a new composer, you can choose the period of his or her artistic creativity!
pl: Tutaj możesz przeglądać ery muzyczne. Kiedy dodajesz nowego kompozytora, wybierz z tej listy okres jego twórczości!

# info.register
source: Welcome to Music History Canon!
pl: Witaj w Kanonie Historii Muzyki!

# info.scales
source: Here you can browse musical scales or keys. When you add a new piece, you can choose its scale.
pl: Tutaj możesz przeglądać tonacje i skale muzyczne. Kiedy dodajesz nowy utwór, możesz wybrać jego skalę.

# info.users
source: Here you can check who is the best contributor and student. Gain experience and levels by adding data to our app or by learning canons!
pl: Tutaj sprawdzisz, kto najbardziej przyczynia się do rozwoju tej aplikacji! Zdobywaj doświadczenie i poziomy, dodając nowe dane do bazy lub słuchając swoich kanonów!

# label.actions
source: Actions
pl: Działania

# label.agree_terms
source: I agree to terms
pl: Zgadzam się z warunkami użytkowania

# label.friends
source: My friends
pl: Moi znajomi

# label.friends_with_me
source: Friends with me
pl: Jestem ich znajomym

# label.title
source: Title
pl: Tytuł

# label.canon_author
source: Canon author
pl: Autor kanonu

# label.canon_name
source: Canon name
pl: Nazwa kanonu

# label.canon_description
source: Canon description
pl: Opis kanonu

# label.canon_piece
source: Pieces
pl: Utwory

# label.composer
source: Composer
pl: Kompozytor

# label.composer_author
source: Added by
pl: Dodane przez

# label.composer_birth_year
source: Composer's birth year
pl: Rok urodzin kompozytora

# label.composer_death_year
source: Composer's death year
pl: Rok śmierci kompozytora

# label.composer_description
source: Composer description
pl: Opis kompozytora

# label.composer_edited_by
source: Edited by
pl: Edytowane przez

# label.composer_last_name
source: Composer's last name
pl: Nazwisko kompozytora

# label.composer_name
source: Composer's name
pl: Imię kompozytora

# label.composer_period
source: Composer's creative period
pl: Okres twórczości kompozytora

# label.composer_period_name
source: Composer's creative period
pl: Okres twórczości kompozytora

# label.content
source: Content
pl: Zawartość

# label.created_at
source: Created at
pl: Utworzono

# label.draw
source: Draw another!
pl: Losuj kolejny!

# label.new_password
source: New password
pl: Nowe hasło

# label.none
source: none
pl: brak

# label.password
source: Password
pl: Hasło

# label.password_repeat
source: Repeat password
pl: Powtórz hasło

# label.period
source: Period
pl: Era

# label.period_author
source: Added by
pl: Dodano przez

# label.period_start_year
source: Beginning year
pl: Początek ery

# label.period_end_year
source: Ending year
pl: Koniec ery

# label.period_description
source: Period description
pl: Opis ery

# label.period_edited_by
source: Edited by
pl: Edytowane przez

# label.period_name
source: Period's name
pl: Nazwa ery

# label.piece_author
source: Added by
pl: Dodane przez

# label.piece_canon
source: Canons
pl: Kanony

# label.piece_canons
source: Canons
pl: Kanony

# label.piece_composer
source: Piece composer
pl: Kompozytor utworu

# label.piece_description
source: Piece description
pl: Opis utworu

# label.piece_edited_by
source: Edited by
pl: Edytowane przez

# label.piece_link
source: YouTube link (with optional timestamp)
pl: Link YouTube (z opcjonalnym timestampem)

# label.piece_name
source: Piece name
pl: Tytuł utworu

# label.piece_tags
source: Tags
pl: Tagi

# label.piece_year
source: Year of creation
pl: Rok powstania

# label.piece_scale
source: Scale
pl: Tonacja

# label.profile_image
source: Profile image
pl: Zdjęcie profilowe

# label.registered_at
source: Registered at
pl: Data rejestracji

# label.remember_me
source: Remember me
pl: Zapamiętaj mnie

# label.scale
source: Scale
pl: Tonacja

# label.scale_name
source: Scale name
pl: Tonacja

# label.tags
source: Tags
pl: Tagi

# label.updated_at
source: Updated at
pl: Zaktualizowano

# label.user_canons
source: User canons
pl: Kanony użytkownika

# label.user_composers
source: User composers
pl: Kompozytorzy dodani przez użytkownika

# label.user_email
source: Your email
pl: Twój email

# label.user_experience
source: Experience
pl: Doświadczenie

# label.user_image
source: %name% profile image
pl: Zdjęcie profilowe użytkownika %name%

# label.user_level
source: Level
pl: Poziom

# label.user_name
source: User name
pl: Nazwa użytkownika

# label.user_old_password
source: Your old password
pl: Twoje stare hasło

# label.user_password
source: Your password
pl: Twoje hasło

# label.user_pieces
source: User pieces
pl: Utwory dodane przez użytkownika

# label.user_place
source: Place
pl: Miejsce

# label.user_roles
source: Role
pl: Rola

# mail.confirm
source: Confirm mail
pl: Potwierdź email

# mail.confirm_mail_please
source: To be able to use Music History Canon without any restrictions, please confirm your email by clicking the link below:
pl: Żeby korzystać z Kanonu Historii Muzyki bez ograniczeń, potwierdź swój email poprzez kliknięcie w link poniżej:

# mail.end_message
source: See you soon on Music History Canon!
pl: Do zobaczenia w Kanonie Historii Muzyki!

# mail.hello
source: Welcome to Music History Canon!
pl: Witaj w Kanonie Historii Muzyki!

# mail.reset_mail
source: A request to reset your password at Music History Canon was sent. If you want to reset the password, please click the link below.
pl: Wysłano żądanie zresetowania Twojego hasła w Kanonie Historii Muzyki. Jeśli chcesz zresetować hasło, kliknij w poniższy link.

# mail.reset_password
source: Reset your password
pl: Zresetuj swoje hasło

# mail.subject
source: Welcome to Music History Canon!
pl: Witaj w Kanonie Historii Muzyki!

# mail.subject_password_reset
source: Reset your password - Music History Canon!
pl: Zresetuj swoje hasło – Kanon Historii Muzyki

# mail.mail_will_expire_in
source: Link in this mail will expire in
pl: Link w tym mailu wygaśnie za

# menu.home
source: Home
pl: Strona główna

# menu.composers
source: Composers
pl: Kompozytorzy

# menu.pieces
source: Pieces
pl: Utwory

# menu.periods
source: Periods
pl: Ery

# menu.scales
source: Scales
pl: Tonacje

# menu.canons
source: Canons
pl: Kanony

# menu.users
source: Leaderboard
pl: Tablica wyników

# menu.flashcards
source: Flashcards
pl: Fiszki

# message.access_denied
source: You don't have permissions to view this page.
pl: Nie posiadasz uprawnień do wyświetlania tej strony.

# message.added_to_friends
source: Added to friends
pl: Dodano do znajomych

# message.already_have_account
source: You already have an account?
pl: Posiadasz już konto?

# message.created_successfully
source: Created successfully!
pl: Utworzono pomyślnie!

# message.canon_has_pieces
source: This canon contains pieces and can't be deleted!
pl: W tym kanonie są jakieś utwory i nie może być usunięty!

# message.check_spam_or
source: Check your spam folder or
pl: Sprawdź folder spam lub

# message.canon_is_empty
source: This canon is empty.
pl: Ten kanon jest pusty.

# message.choose_canon
source: Choose a canon!
pl: Wybierz kanon!

# message.composer_has_pieces
source: This composer has pieces and can't be deleted!
pl: Ten kompozytor ma przypisane utwory i nie można go usunąć!

# message.deleted_successfully
source: Deleted successfully!
pl: Usunięto pomyślnie!

# message.edited_invalid_old_password
source: Invalid old password
pl: Nieprawidłowe stare hasło

# message.edited_successfully
source: Edited successfully!
pl: Edytowano pomyślnie!

# message.email_verified
source: Email verified successfully!
pl: Email został zweryfikowany poprawnie!

# message.empty_list
source: List is empty.
pl: Lista jest pusta.

# message.enter_your_email
source: Please enter your email
pl: Wpisz swój email

# message.error
source: Sorry, something went wrong.
pl: Przepraszamy, coś poszło nie tak.

# message.forgot_password
source: Forgot password?
pl: Zapomniałeś hasła?

# message.form_error
source: Invalid data!
pl: Złe dane!

# message.item_not_found
source: Item not found
pl: Nie znaleziono

# message.logged_in_as
source: You are logged in as
pl: Jesteś zalogowany jako

# message.logged_in_description
source: Do you want to login to another account?
pl: Chcesz zalogować się na inne konto?

# message.mail_expires_in
source: Mail will expire in
pl: Mail wygaśnie w ciągu

# message.page_not_found
source: The page you were looking for was not found. Look for spelling mistakes and try again.
pl: Strona, której szukasz, nie istnieje. Sprawdź literówki w adresie URL i spróbuj ponownie.

# message.password_changed
source: Password has been changed successfully
pl: Hasło zostało zmienione

# message.period_has_pieces
source: This period has pieces and can't be deleted!
pl: Ta era ma utwory i nie można jej usunąć!

# message.piece_in_canons
source: This piece is used in some canons and can't be deleted!
pl: Ten utwór jest używany w kanonach i nie może być usunięty!

# message.record_not_found
source: Record not found.
pl: Nie znaleziono.

# message.registered_successfully
source: Registered successfully
pl: Zarejestrowano pomyślnie

# message.removed_from_friends
source: Removed from friends
pl: Usunięto ze znajomych

# message.verify_email_first
source: Verify your email first.
pl: Najpierw zweryfikuj swój email.

# period.ancient
source: Ancient
pl: Starożytność

# period.ancient_description
source: Music of ancient times was characterized by use of monophony, frequent improvisation and dominance of oral means.
pl: Muzyka starożytnej Grecji charakteryzowała się użyciem monofonii, częstymi improwizacjami i dominacją ludzkiego głosu nad instrumentami.

# period.medieval
source: Medieval
pl: Średniowiecze

# period.medieval_description
source: Medieval music was centered around the institution of the Church. Gregorian chants, music masses and choral music are its domain.
pl: Muzyka średniowiecza była skupiona wokół instytucji Kościoła. Domeną średniowiecza były chorały gregoriańskie, msze muzyczne i muzyka chórlna.

# period.renaissance
source: Renaissance
pl: Renesans

# period.renaissance_description
source: Music of renaissance was freed from strict medieval constraints of church music. Counterpoint and polyphony were very common.
pl: Muzyka renesansu uwolniła się ze ścisłych ograniczeń muzyki kościelnej. Kontrapunkt i polifonia były bardzo popularne w tej erze.

# period.baroque
source: Baroque
pl: Barok

# period.baroque_description
source: Music of baroque gave birth to the common-practice tonality. Basso continuo technique was used very often.
pl: Muzyka baroku dała początek harmonii funkcyjnej. Popularna stała się technika nazywana basso continuo.

# period.classical
source: Classical
pl: Klasycyzm

# period.classical_description
source: Classical period music had light and clear texture. Classic sonata and symphony forms were born.
pl: Muzyka klasycyzmu miała lekką i przejrzystą fakturę. Narodziły się formy sonaty klasycznej i symfonii.

# period.early_romantic
source: Early romantic
pl: Wczesny romantyzm

# period.early_romantic_description
source: Early romantic period was a bridge between Classical and Romantic eras, built by Ludvig van Beethoven.
pl: Wczesny romantyzm był pomostem pomiędzy erą klasyczną i romantyczną, zbudowanym przez Ludwiga van Beethovena.

# period.romantic
source: Romantic
pl: Romantyzm

# period.romantic_description
source: Romantic music was full of emotion and vigor. Musical pieces were often programmatic - they developed additional narrative by the means of music.
pl: Muzyka romantyzmu była pełna emocji i wigoru. Utwory często były programowe – prowadziły dodatkową narrację przy użyciu środków muzycznych.

# period.contemporary
source: Contemporary
pl: Współczesność

# period.contemporary_description
source: Music of 20th century to present. Dissonance, neoclassicism, serialism and spectralism are only a few terms related to this abundant era.
pl: Muzyka XX wieku do współczesności. Dysonans, neoklasycyzm, serializm i spektralizm to tylko jedne z niewielu terminów związanych z tą obfitą muzycznie erą.

# period.unknown
source: Unknown
pl: Nieznana

# period.other
source: Other
pl: Inna

# role.user
source: User
pl: Użytkownik

# scale.c_major
source: C major
pl: C-dur

# scale.c_minor
source: C minor
pl: c-moll

# scale.g_major
source: G major
pl: G-dur

# scale.g_minor
source: G minor
pl: g-moll

# scale.d_major
source: D major
pl: D-dur

# scale.d_minor
source: D minor
pl: d-moll

# scale.a_major
source: A major
pl: A-dur

# scale.a_minor
source: A minor
pl: a-moll

# scale.e_major
source: E major
pl: E-dur

# scale.e_minor
source: E minor
pl: e-moll

# scale.b_major
source: B major
pl: H-dur

# scale.b_minor
source: B minor
pl: H-moll

# scale.f_sharp_major
source: F♯ major
pl: Fis-dur

# scale.f_sharp_minor
source: F♯ minor
pl: fis-moll

# scale.c_sharp_major
source: C♯ major
pl: Cis-dur

# scale.c_sharp_minor
source: C♯ minor
pl: cis-moll

# scale.f_major
source: F major
pl: F-dur

# scale.f_minor
source: F minor
pl: f-moll

# scale.b_flat_major
source: B♭ major
pl: B-dur

# scale.b_flat_minor
source: B♭ minor
pl: b-moll

# scale.e_flat_major
source: E♭ major
pl: Es-dur

# scale.e_flat_minor
source: E♭ minor
pl: e-moll

# scale.a_flat_major
source: A♭ major
pl: As-dur

# scale.a_flat_minor
source: A♭ minor
pl: as-moll

# scale.d_flat_major
source: D♭ major
pl: Des-dur

# scale.d_flat_minor
source: D♭ minor
pl: des-moll

# scale.g_flat_major
source: G♭ major
pl: Ges-dur

# scale.g_flat_minor
source: G♭ minor
pl: ges-moll

# scale.chromatic
source: chromatic
pl: chromatyczna

# scale.pentatonic
source: pentatonic
pl: pentatonika

# scale.whole_tone
source: whole-tone
pl: całotonowa

# scale.acoustic
source: acoustic
pl: akustyczna

# scale.ionian
source: ionian
pl: jońska

# scale.dorian
source: dorian
pl: dorycka

# scale.phrygian
source: phrygian
pl: frygijska

# scale.lydian
source: lydian
pl: lidyjska

# scale.mixolydian
source: mixolydian
pl: miksolidyjska

# scale.aeolian
source: aeolian
pl: eolska

# scale.locrian
source: locrian
pl: lokrycka

# scale.blues
source: blues
pl: bluesowa

# scale.atonal
source: atonal
pl: atonalna

# scale.unknown
source: unknown
pl: nieznana

# scale.other
source: other
pl: inna

# title.access_denied
source: 403 - Access denied!
pl: 403 – Brak dostępu!

# title.canon_create
source: Create new canon
pl: Dodaj nowy kanon

# title.canon_delete
source: Delete canon %name%?
pl: Usunąć kanon %name%?

# title.canon_details
source: %name% - details
pl: %name% – szczegóły

# title.canon_edit
source: Edit canon %name%
pl: Edytuj kanon %name%

# title.canon_list
source: List of canons
pl: Lista kanonów

# title.composer_create
source: Create new composer
pl: Dodaj nowego kompozytora

# title.composer_delete
source: Delete composer %name%?
pl: Usuńąć kompozytora %name%?

# title.composer_details
source: %name% - details
pl: %name% – szczegóły

# title.composer_edit
source: Edit composer %name%
pl: Edytuj kompozytora %name%

# title.composer_list
source: List of composers
pl: Lista kompozytorów

# title.error
source: Error occurred!
pl: Wystąpił błąd!

# title.index
source: Home page
pl: Strona główna

# title.flashcards
source: Flashcards
pl: Fiszki

# title.flashcards_learn
source: Flashcards - %name%
pl: Fiszki – %name%

# title.page_not_found
source: 404 - Page was not found!
pl: 404 – Strony nie odnaleziono!

# title.period_list
source: List of periods
pl: Lista okresów muzycznych

# title.period_details
source: %name% - details
pl: %name% – szczegóły

# title.piece_canons
source: Piece canons
pl: Kanony utworu

# title.piece_composer
source: Piece composer
pl: Kompozytor

# title.piece_create
source: Create new piece
pl: Dodaj nowy utwór

# title.piece_delete
source: Delete piece %name%?
pl: Usunąć utwór %name%?

# title.piece_details
source: %name% - details
pl: %name% – szczegóły

# title.piece_edit
source: Edit piece %name%
pl: Edytuj utwór %name%

# title.piece_list
source: List of pieces
pl: Lista utworów

# title.piece_tags
source: Piece tags
pl: Tagi utworu

# title.reset_password
source: Reset your password
pl: Zresetuj hasło

# title.reset_password_email_sent
source: Reset password email was sent.
pl: Wysłano email do zresetowania hasła.

# title.register
source: Register
pl: Rejestracja

# title.scale_details
source: %name% - details
pl: %name% – szczegóły

# title.scale_list
source: List of scales
pl: Lista tonacji

# title.sign_in
source: Sign in
pl: Logowanie

# title.user_canons
source: Canons of user %name%
pl: Kanony użytkownika %name%

# title.user_composers
source: Composers added by %name%
pl: Kompozytorzy dodani przez uzytkownika %name%

# title.user_details
source: %name% - details
pl: %name% – szczegóły

# title.user_edit
source: %name% - edit data
pl: %name% – edycja danych

# title.user_list
source: Leaderboard
pl: Tabela wyników

# title.user_pieces
source: Pieces added by %name%
pl: Utwory dodane przez użytkownika %name%

# title.user_profile_image
source: Change profile image
pl: Zmień zdjęcie profilowe
